samples/ProxyingaSOAPService/src/test/wso2mi/ProxyForEchoServiceTest.xml

<unit-test>
  <artifacts>
    <test-artifact>
      <artifact>src/main/wso2mi/artifacts/proxy-services/ProxyForEchoService.xml</artifact>
    </test-artifact>
    <supportive-artifacts>
      <artifact>src/main/wso2mi/artifacts/proxy-services/echo.xml</artifact>
      <artifact>src/main/wso2mi/artifacts/endpoints/EchoSoapEP.xml</artifact>
    </supportive-artifacts>
    <registry-resources></registry-resources>
    <connector-resources></connector-resources>
  </artifacts>
  <test-cases>
    <test-case name="EchoService">
      <input>
        <payload>&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
    &lt;soapenv:Header/&gt;
    &lt;soapenv:Body&gt;
        &lt;echo:echoString xmlns:echo=&quot;http://echo.services.core.carbon.wso2.org&quot;&gt;
            &lt;in&gt;Hello&lt;/in&gt;
        &lt;/echo:echoString&gt;
    &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</payload>
        <properties>
          <property name="Content-Type" scope="transport" value="text/xml"></property>
        </properties>
      </input>
      <assertions>
        <assertEquals>
          <actual>$body</actual>
          <expected>&lt;ns:echoStringResponse xmlns:ns=&quot;http://echo.services.core.carbon.wso2.org&quot;&gt;&lt;return&gt;Hello&lt;/return&gt;&lt;/ns:echoStringResponse&gt;</expected>
          <message>Echo Service test case failed.</message>
        </assertEquals>
      </assertions>
    </test-case>
  </test-cases>
  <mock-services></mock-services>
</unit-test>
